{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 10, "batch_input_shape": [null, 5], "W_regularizer": null, "dropout": 0.0, "output_dim": 50, "input_length": 5}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "embedding_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "relu", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 50, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 64, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "lstm_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "timedistributed_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 64, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 10}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["lstm_1", 0, 0]]], "name": "timedistributed_1"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["timedistributed_1", 0, 0]], "name": "model_1"}}